In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('static/data/hero-network.csv')
df['value'] = 1
df['hero1'] = df['hero1'].apply(lambda x: x.split('/')[0])
df['hero2'] = df['hero2'].apply(lambda x: x.split('/')[0])
display(df)

                hero1              hero2  value
0       LITTLE, ABNER     PRINCESS ZANDA      1
1       LITTLE, ABNER      BLACK PANTHER      1
2       BLACK PANTHER     PRINCESS ZANDA      1
3       LITTLE, ABNER     PRINCESS ZANDA      1
4       LITTLE, ABNER      BLACK PANTHER      1
...               ...                ...    ...
574462    COLOSSUS II           CALLISTO      1
574463       CALLISTO             ROGUE       1
574464       CALLISTO            CALIBAN      1
574465        CALIBAN             ROGUE       1
574466           HULK  MARKS, DR. SHIELA      1

[574467 rows x 3 columns]

In [3]:
df_counts = df.drop(['hero2'], axis=1)
df_counts = df_counts.groupby(['hero1']).sum()
df_counts

             value
hero1
24-HOUR MAN      3
3-D MAN         50
4-D MAN         39
8-BALL           9
A                8
...            ...
ZOTA             5
ZOTA, CARLO     61
ZURAS          143
ZURI           119
ZZZAX           23

[6203 rows x 1 columns]

In [4]:
temp100df = df_counts.reset_index()
temp100df = temp100df.sort_values(ascending=False, by='value')
temp100df = temp100df.iloc[:100].reset_index(drop=True)
display(temp100df)
top100 = temp100df.iloc[:100].reset_index(drop=True)['hero1'].unique()
top100

                  hero1  value
0       CAPTAIN AMERICA   8149
1            SPIDER-MAN   6652
2              IRON MAN   5850
3                  THOR   5712
4                 THING   5369
..                  ...    ...
95               TRITON   1036
96                 PUCK   1028
97            IRON FIST   1008
98           JUSTICE II   1003
99  COOPER, DR. VALERIE    978

[100 rows x 2 columns]

array(['CAPTAIN AMERICA', 'SPIDER-MAN', 'IRON MAN', 'THOR', 'THING',
       'WOLVERINE', 'SCARLET WITCH', 'VISION ', 'HUMAN TORCH',
       'MR. FANTASTIC', 'INVISIBLE WOMAN', 'BEAST', 'HAWK', 'CYCLOPS',
       'WASP', 'STORM', 'COLOSSUS II', 'PROFESSOR X', 'ANT-MAN',
       'MARVEL GIRL', 'HULK', 'ICEMAN', 'WONDER MAN', 'ANGEL',
       'NIGHTCRAWLER', 'ROGUE ', 'DR. STRANGE', 'SHE-HULK', 'PATRIOT',
       'JAMESON, J. JONAH', 'SUB-MARINER', 'QUICKSILVER',
       'JARVIS, EDWIN ', 'BLACK WIDOW', 'HERCULES [GREEK GOD]',
       'WATSON-PARKER, MARY ', 'DAREDEVIL', 'SHADOWCAT', 'PSYLOCKE',
       'CANNONBALL II', 'CRYSTAL [INHUMAN]', 'HAVOK',
       'FURY, COL. NICHOLAS ', 'BLACK KNIGHT V', 'WOLFSBANE',
       'QUASAR III', 'ROBERTSON, JOE', 'BLACK PANTHER',
       'RICHARDS, FRANKLIN B', 'POLARIS', 'GAMBIT', 'ODIN [ASGARDIAN]',
       'MAGNETO', 'DR. DOOM', 'PARKER, MAY', 'SILVER SURFER', 'NOVA',
       'SUMMERS, NATHAN CHRI', 'MISS AMERICA', 'MOONDRAGON',
       'THUNDERSTRIKE', 'SUNSPOT', 'NAMORITA', 'HOGUN [ASGARDIAN]',
       'USAGENT', 'CAPTAIN MARVEL II', 'JONES, RICHARD MILHO', 'FIRESTAR',
       'BANSHEE', 'SASQUATCH', 'FALCON', 'SIF', 'MACTAGGERT, MOIRA KI',
       'FANDRAL [ASGARDIAN]', 'BALDER [ASGARDIAN]', 'BOOMER', 'SERSI',
       'TIGRA', 'LEEDS, BETTY BRANT', 'THOMPSON, EUGENE FLA',
       'LOKI [ASGARDIAN]', 'JUBILEE', 'BINARY', 'VOLSTAGG', 'MEDUSA',
       'SHAMAN', 'HUDSON, HEATHER', 'GORGON [INHUMAN]', 'BLACK BOLT',
       'MIRAGE II', 'IRON MAN IV', 'GALACTUS', 'CAGE, LUKE',
       'NELSON, FRANKLIN FOG', 'STARFOX', 'TRITON', 'PUCK', 'IRON FIST',
       'JUSTICE II', 'COOPER, DR. VALERIE'], dtype=object)

In [5]:
# df but only where hero1 and hero2 in top 100
top100df = df.copy()
print(top100df['hero1'].unique().shape)
print(top100df['hero2'].unique().shape)
top100df = top100df[top100df.hero1.isin(top100)]
top100df = top100df[top100df.hero2.isin(top100)]
print(top100df['hero1'].unique().shape)
print(top100df['hero2'].unique().shape)
top100df

(6203,)
(6165,)
(100,)
(100,)

              hero1        hero2  value
17      IRON MAN IV     IRON MAN      1
46      IRON MAN IV     IRON MAN      1
391            NOVA     FIRESTAR      1
393            NOVA     NAMORITA      1
395            NOVA         HULK      1
...             ...          ...    ...
574441         WASP  COLOSSUS II      1
574443         WASP  PROFESSOR X      1
574451  PROFESSOR X       ROGUE       1
574454  PROFESSOR X  COLOSSUS II      1
574460  COLOSSUS II       ROGUE       1

[121083 rows x 3 columns]

In [48]:
linksdf = top100df.copy()
linksdf = linksdf.groupby(['hero1', 'hero2']).count().reset_index()
linksdf = linksdf.rename(columns={'hero1': 'source', 'hero2': 'target'})
linksdf = linksdf.sort_values(['value'], ascending=False)
#linksdf = linksdf[linksdf['value'] >= 15]
linksdf = linksdf[linksdf['value'] >= 15]
display(linksdf)
#print(linksdf['value'].mean())

                 source                target  value
4610            PATRIOT               PATRIOT   1275
4609            PATRIOT          MISS AMERICA   1267
4023       MISS AMERICA          MISS AMERICA    672
4024       MISS AMERICA               PATRIOT    627
6415              THING           HUMAN TORCH    382
...                 ...                   ...    ...
1790             FALCON         SCARLET WITCH     15
1300  CRYSTAL [INHUMAN]         BLACK PANTHER     15
1784             FALCON            QUASAR III     15
2                 ANGEL               BANSHEE     15
297               BEAST  FURY, COL. NICHOLAS      15

[2015 rows x 3 columns]

In [49]:
print(len(linksdf['source'].unique()))
print(len(linksdf['target'].unique()))
print(len(top100df['hero1'].unique()))

100
100
100

In [50]:
nodesdf = pd.DataFrame()
nodesdf['id'] = temp100df['hero1']
nodesdf['group'] = 1
nodesdf.shape
nodesdf

                     id  group
0       CAPTAIN AMERICA      1
1            SPIDER-MAN      1
2              IRON MAN      1
3                  THOR      1
4                 THING      1
..                  ...    ...
95               TRITON      1
96                 PUCK      1
97            IRON FIST      1
98           JUSTICE II      1
99  COOPER, DR. VALERIE      1

[100 rows x 2 columns]

In [51]:
nodesdf.to_json(path_or_buf='src/components/10nodes.json', orient='records')

In [52]:
linksdf.to_json(path_or_buf='src/components/10links.json', orient='records')

In [182]:
import json
marveldata = json.load(open('src/components/marvel.json', 'r'))
marvel_nodes = pd.DataFrame.from_records(marveldata['nodes'])
display(marvel_nodes['id'])

0      10699
1      10698
2      11996
3      10693
4      10692
       ...
198    10774
199    10775
200    10940
201    10779
202    10829
Name: id, Length: 203, dtype: object

In [184]:
di = marvel_nodes[['id', 'name']].groupby('id').max().reset_index(drop=False).set_index('id').to_dict('dict')
di = di['name']

In [180]:
marvel_links = pd.read_csv('src/components/marvel_edges.csv')#pd.DataFrame.from_records(marveldata['links'])
display(marvel_links['Source'], marvel_links['Target'])
marvel_links = marvel_links.drop(columns=['Type', 'label', 'timeset'])
marvel_links = marvel_links.rename(columns={'weight':'value', 'Source':'source', 'Target':'target'})
marvel_links['source'] = marvel_links['source'].apply(lambda x: di[str(x)] if (str(x) in di) else None)
marvel_links['target'] = marvel_links['target'].apply(lambda x: di[str(x)] if (str(x) in di) else None)
marvel_links = marvel_links.dropna()
display(marvel_links)

0       10570
1       10747
2       10565
3       10565
4       10571
        ...
5508    17153
5509    17471
5510    17471
5511    17475
5512    17788
Name: Source, Length: 5513, dtype: int64

0       10747
1       10565
2       10570
3       10571
4       10744
        ...
5508    17475
5509    11971
5510    17475
5511    11971
5512    12298
Name: Target, Length: 5513, dtype: int64

                    source                target      id  value
0     Thing/Benjamin J. Gr  Human Torch/Johnny S  225737    382
1     Human Torch/Johnny S  Mr. Fantastic/Reed R  227884    366
2     Mr. Fantastic/Reed R  Thing/Benjamin J. Gr  225378    365
3     Mr. Fantastic/Reed R   Invisible Woman/Sue  225379    362
4      Invisible Woman/Sue  Human Torch/Johnny S  228222    353
...                    ...                   ...     ...    ...
5485                 Leech   Apocalypse/En Sabah  277615     10
5495    Mam'Selle Hepzibah  Colossus Ii/Peter Ra  295614     10
5496    Mam'Selle Hepzibah  Nightcrawler/Kurt Wa  295613     10
5497    Mam'Selle Hepzibah  Binary/Carol Danvers  295616     10
5498        Raza Longknife  Colossus Ii/Peter Ra  295605     10

[2774 rows x 4 columns]

In [173]:
marvel_nodes = marvel_nodes.drop(axis=1, columns=['id']).rename(columns={'name': 'id'})
marvel_nodes

     betweenness    degree  eigenvector  group                    id
0       0.000197  0.059406     0.007674      0           Watson Anna
1       0.007111  0.094059     0.031997      0    Watson-Parker Mary
2       0.000764  0.089109     0.031608      3  Medusa/Medusalith Am
3       0.008221  0.059406     0.008112      0   Kingpin/Wilson Fisk
4       0.000000  0.079208     0.014349      0     Leeds Betty Brant
..           ...       ...          ...    ...                   ...
198     0.024476  0.371287     0.102200      1  Colossus Ii/Peter Ra
199     0.000296  0.069307     0.025833      1               Rogue /
200     0.004798  0.143564     0.082298      3   Richards Franklin B
201     0.000320  0.069307     0.031184      1  Colossus Ii/Peter Ra
202     0.012919  0.287129     0.168953      2  Ant-Man/Dr. Henry J.

[203 rows x 5 columns]

In [174]:
marvel_nodes.to_json(path_or_buf='src/components/marvelnodes.json', orient='records')
marvel_links.to_json(path_or_buf='src/components/marvellinks.json', orient='records')